In [1]:
import pandas as pd
import sqlite3
from pandas.io import sql

In [3]:
df=pd.read_csv('assets/datasets/housing-data.csv', low_memory= False)
df.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 4 columns):
sqft     47 non-null int64
bdrms    47 non-null int64
age      47 non-null int64
price    47 non-null int64
dtypes: int64(4)
memory usage: 1.5 KB

In [6]:
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db)
c = conn.cursor()

In [7]:
df.to_sql('housesDB', con=conn, if_exists='replace', index=False)

In [26]:
sql.read_sql('select bdrms, AVG(price) from housesDB where bdrms=1', con=conn)

   bdrms  AVG(price)
0      1    169900.0

In [10]:
sql.read_sql('select bdrms, AVG(price) from housesDB where bdrms=2', con=conn)

   bdrms     AVG(price)
0      2  280866.666667

In [56]:
sql.read_sql('select bdrms, count(bdrms) from housesDB GROUP BY bdrms order by COUNT(bdrms) desc', con=conn)

   bdrms  count(bdrms)
0      3            25
1      4            14
2      2             6
3      1             1
4      5             1

In [29]:
sql.read_sql('select count(bdrms) from housesDB GROUP BY bdrms order by COUNT(bdrms) desc limit 1', con=conn)

   count(bdrms)
0            25

In [54]:
sql.read_sql('select bdrms, ((select count(bdrms) from housesDB where bdrms=3)+0.0)/count(bdrms) as ratio from housesDB', con=conn)

   bdrms     ratio
0      3  0.531915

In [34]:
sql.read_sql('select age from housesDB where bdrms=3 group by age order by age desc limit 1', con=conn)

   age
0   78

In [35]:
sql.read_sql('select age from housesDB group by age order by age asc limit 1', con=conn)

   age
0    5

In [36]:
sql.read_sql('select avg(age) from housesDB', con=conn)

    avg(age)
0  42.744681

In [37]:
sql.read_sql('select bdrms, avg(age) from housesDB group by bdrms', con=conn)

   bdrms   avg(age)
0      1   5.000000
1      2  56.666667
2      3  38.360000
3      4  46.857143
4      5  49.000000